#ifndef _CONFIG_
#define _CONFIG_
/**********************************************************************************************************
* @文件名：	config.h
* @功能描述： 配置文件，有时候修改配置文件后执行make不一定会重新编译涉及到的源文件，此时需要
			执行make clean再重新执行make
*--------------------------------------------------------------------------------------------------------------------------
* 修改日期        版本号     修改人	      修改内容
* 2016/12/15  	V1.0		薛文旺	      创建
***********************************************************************************************************/

/* 是否需要调试 */
#define DEBUG 0

#if DEBUG
#define DBG_PRINTF printf
long delta;	
#else
#define DBG_PRINTF(...)
#endif

/* 协议长度（字节）*/
#define CMD_SIZE 8


/* 串口的设备节点 */
#define SERIAL_NAME (char *)"/dev/ttyS4"
/* 串口波特率 */
#define BUAD  9600


/* LED引脚端口 */
#define LED_PIN		32		//GPIO1_A0		有球指示灯
#define LED_WORK	33		//GPIO1_A1		程序工作指示灯



#endif //_CONFIG_
