#ifndef	_SERIALS_
#define	_SERIALS_
/**************************************************************************************
 * @文件名：	serials.h
 * @功能描述： 串口初始化和串口发送函数
 * ----------------------------------------------------------------------
 * 修改日期        版本号     修改人	      修改内容
 * 2016/12/10  	V1.0		薛文旺	      创建
 ***************************************************************************************/

#include <stdio.h>
#include <string.h>
#include <sys/types.h>
#include <errno.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <termios.h>
#include <stdlib.h>
#include "config.h"



#ifdef __cplusplus
extern "C" {
#endif

class serials
{
public:
	int fd;
	char *name;
	
public:
	/*****************************************************************************************
	* @方法名:	 serials	 
	* @描述:	   构造方法
	* @权限:	   public
	* @形参:	   name --设备节点名
	* @返回值:	 无
	* ---------------------------------------------------------------------
	* @修改日期 @版本号	  @修改人	   @修改内容
	* 2016/12/10	V1.0		   薛文旺		创建
	*****************************************************************************************/
	serials(char * name);	
	

	/*****************************************************************************************
	* @函数名：set_opt
	* @描述：	设置串口波特率、数据位数、有无校验位和停止位数
	* @权限：	public
	* @形参：	nSpeed--波特率，支持2400、4800、9600、115200、921600，默认9600
				 nBits--数据位数  
				 nEvent--有无校验位，'O'表示奇校验，'E'表示偶校验，'N'表示无校验
				 nStop--停止位数，1和2位
	* @返回值：0--成功		-1--失败		 
	*-------------------------------------------------------------------------------------------------------
	*@修改日期	@版本号	@修改人	@修改内容
	1016/12/10	V1.0		薛文旺	创建
	*****************************************************************************************/
	int set_opt(int nSpeed, int nBits, char nEvent, int nStop);


	
	/**********************************************************************************
	* @函数名：open_port
	* @描述：	打开串口
	* @权限：	public
	* @形参：	无
	* @返回值：返回文件句柄， -1--打开失败  
	*----------------------------------------------------------------------------------------------
	* @修改日期 @版本号	@修改人	@修改内容
	* 2016/12/10	v1.0		薛文旺	创建
	*********************************************************************************/	
	int open_port();	

	
	/**********************************************************************************
	* @函数名：send
	* @描述：	串口发送数据
	* @权限：	public
	* @形参：	buf--数据源地址， num--数据长度
	* @返回值：无 
	*----------------------------------------------------------------------------------------------
	* @修改日期 @版本号	@修改人	@修改内容
	* 2016/12/10	v1.0		薛文旺	创建
	*********************************************************************************/	
	void send(char *buf, int num);
};

#ifdef __cplusplus
}
#endif

#endif //_SERIALS_
